Tekla.Structures.Drawing.IHideable
The IHideable interface is used for each object that can be hidden in the drawing.

Tekla.Structures.Drawing.IHideable.Hideable
Accesses the information if this object is hidden or not or if it should be.